# **Aula 16 - Criação do Esquema lógico e implementação do Postgres em Python**
---

### ***Ferramenta para criação do Esquema Lógico e código SQL automático***
* [Br Modelo Web](Bhttps://www.brmodeloweb.com/lang/pt-br/index.html)

In [1]:
!pip install -q psycopg2

In [2]:
import pandas as pd
import psycopg2 as pg
from sqlalchemy import create_engine

In [35]:
engine = create_engine('postgresql://postgres:123456@localhost/aula16')

In [14]:
query = 'SELECT * FROM cliente'
df = pd.read_sql_query(query, con = engine)
df

   cli_id  cli_nome cli_endereço
0      13  Bernardo       Rua 10
1      14     Lucas       Rua 15

In [20]:
query = 'SELECT * FROM livro'
df = pd.read_sql_query(query, con = engine)
df

   liv_id        liv_titulo liv_isbn
0       1   Assassins creed   445566
1       2  Cavalo de guerra  8493478
2       3           exemplo  2349234

In [39]:
query = 'SELECT * FROM venda'
df = pd.read_sql_query(query, con = engine)
df

   ven_id  ven_frete  ven_valor  cli_id  liv_id
0       1         12         30      13       1
1       2         34         40      14       2
2       3         34         25      13       3
3       5         22         35      14       2
4       6         40         45      13       2
5       8         34         52      13       1

In [36]:
conn = pg.connect(user = 'postgres',
                 password = '123456',
                 host = 'localhost',
                 port = '5432',
                 database = 'aula16')

print(conn.info)
print(conn.status)

<psycopg2.extensions.ConnectionInfo object at 0x000001C44FFDED90>
1

In [37]:
cursor = conn.cursor()

In [ ]:
new_cliente = input("Digite o nome do cliente: ")
new_endereco = input("Digite o endereço do cliente: ")

cursor.execute("insert into cliente (cli_nome, cli_endereço) values ('{nome}', '{endereço}')".format(nome = new_cliente, endereço = new_endereco))
conn.commit()

In [19]:
new_livro = input("Digite o nome do livro: ")
new_isbn = input("Digite o isbn do livro: ")

cursor.execute("insert into livro (liv_titulo, liv_isbn) values ('{tit}', '{isbn}')".format(tit = new_livro, isbn = new_isbn))
conn.commit()

Digite o nome do livro: exemplo
Digite o isbn do livro: 2349234

In [38]:
new_frete = input("Digite o frete da venda: ")
new_valor = input("Digite o valor da venda: ")
cliente = input("Digite o id do cliente: ")
livro = input("Digite o id do livro: ")

cursor.execute("insert into venda (ven_frete, ven_valor, cli_id, liv_id) values ('{frete}', '{valor}', '{cli}', '{liv}')".format(frete = new_frete, valor = new_valor, cli = cliente, liv = livro))
conn.commit()

Digite o frete da venda: 34
Digite o valor da venda: 52
Digite o id do cliente: 13
Digite o id do livro: 1